thelemon22/regis/demo_projects/dsPIC33E/h/p33EP256MU806.h
extern volatile unsigned int  RPOR2 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR2BITS {
  union {
    struct {
      unsigned RP68R:6;
      unsigned :2;
      unsigned RP69R:6;
    };
    struct {
      unsigned RP68R0:1;
      unsigned RP68R1:1;
      unsigned RP68R2:1;
      unsigned RP68R3:1;
      unsigned RP68R4:1;
      unsigned RP68R5:1;
      unsigned :2;
      unsigned RP69R0:1;
      unsigned RP69R1:1;
      unsigned RP69R2:1;
      unsigned RP69R3:1;
      unsigned RP69R4:1;
      unsigned RP69R5:1;
    };
  };
} RPOR2BITS;
extern volatile RPOR2BITS RPOR2bits __attribute__((__sfr__));

extern volatile unsigned int  RPOR3 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR3BITS {
  union {
    struct {
      unsigned RP70R:6;
      unsigned :2;
      unsigned RP71R:6;
    };
    struct {
      unsigned RP70R0:1;
      unsigned RP70R1:1;
      unsigned RP70R2:1;
      unsigned RP70R3:1;
      unsigned RP70R4:1;
      unsigned RP70R5:1;
      unsigned :2;
      unsigned RP71R0:1;
      unsigned RP71R1:1;
      unsigned RP71R2:1;
      unsigned RP71R3:1;
      unsigned RP71R4:1;
      unsigned RP71R5:1;
    };
  };
} RPOR3BITS;
extern volatile RPOR3BITS RPOR3bits __attribute__((__sfr__));

extern volatile unsigned int  RPOR4 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR4BITS {
  union {
    struct {
      unsigned :8;
      unsigned RP80R:6;
    };
    struct {
      unsigned :8;
      unsigned RP80R0:1;
      unsigned RP80R1:1;
      unsigned RP80R2:1;
      unsigned RP80R3:1;
      unsigned RP80R4:1;
      unsigned RP80R5:1;
    };
  };
} RPOR4BITS;
extern volatile RPOR4BITS RPOR4bits __attribute__((__sfr__));

extern volatile unsigned int  RPOR5 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR5BITS {
  union {
    struct {
      unsigned RP82R:6;
      unsigned :2;
      unsigned RP84R:6;
    };
    struct {
      unsigned RP82R0:1;
      unsigned RP82R1:1;
      unsigned RP82R2:1;
      unsigned RP82R3:1;
      unsigned RP82R4:1;
      unsigned RP82R5:1;
      unsigned :2;
      unsigned RP84R0:1;
      unsigned RP84R1:1;
      unsigned RP84R2:1;
      unsigned RP84R3:1;
      unsigned RP84R4:1;
      unsigned RP84R5:1;
    };
  };
} RPOR5BITS;
extern volatile RPOR5BITS RPOR5bits __attribute__((__sfr__));

extern volatile unsigned int  RPOR6 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR6BITS {
  union {
    struct {
      unsigned RP85R:6;
      unsigned :2;
      unsigned RP87R:6;
    };
    struct {
      unsigned RP85R0:1;
      unsigned RP85R1:1;
      unsigned RP85R2:1;
      unsigned RP85R3:1;
      unsigned RP85R4:1;
      unsigned RP85R5:1;
      unsigned :2;
      unsigned RP87R0:1;
      unsigned RP87R1:1;
      unsigned RP87R2:1;
      unsigned RP87R3:1;
      unsigned RP87R4:1;
      unsigned RP87R5:1;
    };
  };
} RPOR6BITS;
extern volatile RPOR6BITS RPOR6bits __attribute__((__sfr__));

extern volatile unsigned int  RPOR7 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR7BITS {
  union {
    struct {
      unsigned RP96R:6;
      unsigned :2;
      unsigned RP97R:6;
    };
    struct {
      unsigned RP96R0:1;
      unsigned RP96R1:1;
      unsigned RP96R2:1;
      unsigned RP96R3:1;
      unsigned RP96R4:1;
      unsigned RP96R5:1;
      unsigned :2;
      unsigned RP97R0:1;
      unsigned RP97R1:1;
      unsigned RP97R2:1;
      unsigned RP97R3:1;
      unsigned RP97R4:1;
      unsigned RP97R5:1;
    };
  };
} RPOR7BITS;
extern volatile RPOR7BITS RPOR7bits __attribute__((__sfr__));

extern volatile unsigned int  RPOR8 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR8BITS {
  union {
    struct {
      unsigned :8;
      unsigned RP99R:6;
    };
    struct {
      unsigned :8;
      unsigned RP99R0:1;
      unsigned RP99R1:1;
      unsigned RP99R2:1;
      unsigned RP99R3:1;
      unsigned RP99R4:1;
      unsigned RP99R5:1;
    };
  };
} RPOR8BITS;
extern volatile RPOR8BITS RPOR8bits __attribute__((__sfr__));

extern volatile unsigned int  RPOR9 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR9BITS {
  union {
    struct {
      unsigned RP100R:6;
      unsigned :2;
      unsigned RP101R:6;
    };
    struct {
      unsigned RP100R0:1;
      unsigned RP100R1:1;
      unsigned RP100R2:1;
      unsigned RP100R3:1;
      unsigned RP100R4:1;
      unsigned RP100R5:1;
      unsigned :2;
      unsigned RP101R0:1;
      unsigned RP101R1:1;
      unsigned RP101R2:1;
      unsigned RP101R3:1;
      unsigned RP101R4:1;
      unsigned RP101R5:1;
    };
  };
} RPOR9BITS;
extern volatile RPOR9BITS RPOR9bits __attribute__((__sfr__));

extern volatile unsigned int  RPOR13 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR13BITS {
  union {
    struct {
      unsigned :8;
      unsigned RP118R:6;
    };
    struct {
      unsigned :8;
      unsigned RP118R0:1;
      unsigned RP118R1:1;
      unsigned RP118R2:1;
      unsigned RP118R3:1;
      unsigned RP118R4:1;
      unsigned RP118R5:1;
    };
  };
} RPOR13BITS;
extern volatile RPOR13BITS RPOR13bits __attribute__((__sfr__));

extern volatile unsigned int  RPOR14 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR14BITS {
  union {
    struct {
      unsigned RP120R:6;
    };
    struct {
      unsigned RP120R0:1;
      unsigned RP120R1:1;
      unsigned RP120R2:1;
      unsigned RP120R3:1;
      unsigned RP120R4:1;
      unsigned RP120R5:1;
    };
  };
} RPOR14BITS;
extern volatile RPOR14BITS RPOR14bits __attribute__((__sfr__));

extern volatile unsigned int  RPINR0 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR0BITS {
  union {
    struct {
      unsigned :8;
      unsigned INT1R:7;
    };
    struct {
      unsigned :8;
      unsigned INT1R0:1;
      unsigned INT1R1:1;
      unsigned INT1R2:1;
      unsigned INT1R3:1;
      unsigned INT1R4:1;
      unsigned INT1R5:1;
      unsigned INT1R6:1;
    };
  };
} RPINR0BITS;
extern volatile RPINR0BITS RPINR0bits __attribute__((__sfr__));

