thelemon22/regis/demo_projects/dsPIC33E/h/p33EP256MU806.h
extern volatile unsigned int  IPC22 __attribute__((__sfr__));
__extension__ typedef struct tagIPC22BITS {
  union {
    struct {
      unsigned U4RXIP:3;
      unsigned :1;
      unsigned U4TXIP:3;
      unsigned :1;
      unsigned SPI3EIP:3;
      unsigned :1;
      unsigned SPI3IP:3;
    };
    struct {
      unsigned U4RXIP0:1;
      unsigned U4RXIP1:1;
      unsigned U4RXIP2:1;
      unsigned :1;
      unsigned U4TXIP0:1;
      unsigned U4TXIP1:1;
      unsigned U4TXIP2:1;
      unsigned :1;
      unsigned SPI3EIP0:1;
      unsigned SPI3EIP1:1;
      unsigned SPI3EIP2:1;
      unsigned :1;
      unsigned SPI3IP0:1;
      unsigned SPI3IP1:1;
      unsigned SPI3IP2:1;
    };
  };
} IPC22BITS;
extern volatile IPC22BITS IPC22bits __attribute__((__sfr__));

extern volatile unsigned int  IPC23 __attribute__((__sfr__));
__extension__ typedef struct tagIPC23BITS {
  union {
    struct {
      unsigned OC9IP:3;
      unsigned :1;
      unsigned IC9IP:3;
      unsigned :1;
      unsigned PWM1IP:3;
      unsigned :1;
      unsigned PWM2IP:3;
    };
    struct {
      unsigned OC9IP0:1;
      unsigned OC9IP1:1;
      unsigned OC9IP2:1;
      unsigned :1;
      unsigned IC9IP0:1;
      unsigned IC9IP1:1;
      unsigned IC9IP2:1;
      unsigned :1;
      unsigned PWM1IP0:1;
      unsigned PWM1IP1:1;
      unsigned PWM1IP2:1;
      unsigned :1;
      unsigned PWM2IP0:1;
      unsigned PWM2IP1:1;
      unsigned PWM2IP2:1;
    };
  };
} IPC23BITS;
extern volatile IPC23BITS IPC23bits __attribute__((__sfr__));

extern volatile unsigned int  IPC24 __attribute__((__sfr__));
__extension__ typedef struct tagIPC24BITS {
  union {
    struct {
      unsigned PWM3IP:3;
      unsigned :1;
      unsigned PWM4IP:3;
    };
    struct {
      unsigned PWM3IP0:1;
      unsigned PWM3IP1:1;
      unsigned PWM3IP2:1;
      unsigned :1;
      unsigned PWM4IP0:1;
      unsigned PWM4IP1:1;
      unsigned PWM4IP2:1;
    };
  };
} IPC24BITS;
extern volatile IPC24BITS IPC24bits __attribute__((__sfr__));

extern volatile unsigned int  IPC29 __attribute__((__sfr__));
__extension__ typedef struct tagIPC29BITS {
  union {
    struct {
      unsigned :8;
      unsigned DMA8IP:3;
      unsigned :1;
      unsigned DMA9IP:3;
    };
    struct {
      unsigned :8;
      unsigned DMA8IP0:1;
      unsigned DMA8IP1:1;
      unsigned DMA8IP2:1;
      unsigned :1;
      unsigned DMA9IP0:1;
      unsigned DMA9IP1:1;
      unsigned DMA9IP2:1;
    };
  };
} IPC29BITS;
extern volatile IPC29BITS IPC29bits __attribute__((__sfr__));

extern volatile unsigned int  IPC30 __attribute__((__sfr__));
__extension__ typedef struct tagIPC30BITS {
  union {
    struct {
      unsigned DMA10IP:3;
      unsigned :1;
      unsigned DMA11IP:3;
      unsigned :1;
      unsigned SPI4EIP:3;
      unsigned :1;
      unsigned SPI4IP:3;
    };
    struct {
      unsigned DMA10IP0:1;
      unsigned DMA10IP1:1;
      unsigned DMA10IP2:1;
      unsigned :1;
      unsigned DMA11IP0:1;
      unsigned DMA11IP1:1;
      unsigned DMA11IP2:1;
      unsigned :1;
      unsigned SPI4EIP0:1;
      unsigned SPI4EIP1:1;
      unsigned SPI4EIP2:1;
      unsigned :1;
      unsigned SPI4IP0:1;
      unsigned SPI4IP1:1;
      unsigned SPI4IP2:1;
    };
  };
} IPC30BITS;
extern volatile IPC30BITS IPC30bits __attribute__((__sfr__));

extern volatile unsigned int  IPC31 __attribute__((__sfr__));
__extension__ typedef struct tagIPC31BITS {
  union {
    struct {
      unsigned OC10IP:3;
      unsigned :1;
      unsigned IC10IP:3;
      unsigned :1;
      unsigned OC11IP:3;
      unsigned :1;
      unsigned IC11IP:3;
    };
    struct {
      unsigned OC10IP0:1;
      unsigned OC10IP1:1;
      unsigned OC10IP2:1;
      unsigned :1;
      unsigned IC10IP0:1;
      unsigned IC10IP1:1;
      unsigned IC10IP2:1;
      unsigned :1;
      unsigned OC11IP0:1;
      unsigned OC11IP1:1;
      unsigned OC11IP2:1;
      unsigned :1;
      unsigned IC11IP0:1;
      unsigned IC11IP1:1;
      unsigned IC11IP2:1;
    };
  };
} IPC31BITS;
extern volatile IPC31BITS IPC31bits __attribute__((__sfr__));

extern volatile unsigned int  IPC32 __attribute__((__sfr__));
__extension__ typedef struct tagIPC32BITS {
  union {
    struct {
      unsigned OC12IP:3;
      unsigned :1;
      unsigned IC12IP:3;
      unsigned :1;
      unsigned DMA12IP:3;
      unsigned :1;
      unsigned DMA13IP:3;
    };
    struct {
      unsigned OC12IP0:1;
      unsigned OC12IP1:1;
      unsigned OC12IP2:1;
      unsigned :1;
      unsigned IC12IP0:1;
      unsigned IC12IP1:1;
      unsigned IC12IP2:1;
      unsigned :1;
      unsigned DMA12IP0:1;
      unsigned DMA12IP1:1;
      unsigned DMA12IP2:1;
      unsigned :1;
      unsigned DMA13IP0:1;
      unsigned DMA13IP1:1;
      unsigned DMA13IP2:1;
    };
  };
} IPC32BITS;
extern volatile IPC32BITS IPC32bits __attribute__((__sfr__));

extern volatile unsigned int  IPC33 __attribute__((__sfr__));
__extension__ typedef struct tagIPC33BITS {
  union {
    struct {
      unsigned DMA14IP:3;
      unsigned :5;
      unsigned OC13IP:3;
      unsigned :1;
      unsigned IC13IP:3;
    };
    struct {
      unsigned DMA14IP0:1;
      unsigned DMA14IP1:1;
      unsigned DMA14IP2:1;
      unsigned :5;
      unsigned OC13IP0:1;
      unsigned OC13IP1:1;
      unsigned OC13IP2:1;
      unsigned :1;
      unsigned IC13IP0:1;
      unsigned IC13IP1:1;
      unsigned IC13IP2:1;
    };
  };
} IPC33BITS;
extern volatile IPC33BITS IPC33bits __attribute__((__sfr__));

extern volatile unsigned int  IPC34 __attribute__((__sfr__));
__extension__ typedef struct tagIPC34BITS {
  union {
    struct {
      unsigned OC14IP:3;
      unsigned :1;
      unsigned IC14IP:3;
      unsigned :1;
      unsigned OC15IP:3;
      unsigned :1;
      unsigned IC15IP:3;
    };
    struct {
      unsigned OC14IP0:1;
      unsigned OC14IP1:1;
      unsigned OC14IP2:1;
      unsigned :1;
      unsigned IC14IP0:1;
      unsigned IC14IP1:1;
      unsigned IC14IP2:1;
      unsigned :1;
      unsigned OC15IP0:1;
      unsigned OC15IP1:1;
      unsigned OC15IP2:1;
      unsigned :1;
      unsigned IC15IP0:1;
      unsigned IC15IP1:1;
      unsigned IC15IP2:1;
    };
  };
} IPC34BITS;
extern volatile IPC34BITS IPC34bits __attribute__((__sfr__));

extern volatile unsigned int  IPC35 __attribute__((__sfr__));
__extension__ typedef struct tagIPC35BITS {
  union {
    struct {
      unsigned OC16IP:3;
      unsigned :1;
      unsigned IC16IP:3;
      unsigned :1;
      unsigned ICDIP:3;
    };
    struct {
      unsigned OC16IP0:1;
      unsigned OC16IP1:1;
      unsigned OC16IP2:1;
      unsigned :1;
      unsigned IC16IP0:1;
      unsigned IC16IP1:1;
      unsigned IC16IP2:1;
      unsigned :1;
      unsigned ICDIP0:1;
      unsigned ICDIP1:1;
      unsigned ICDIP2:1;
    };
  };
} IPC35BITS;
extern volatile IPC35BITS IPC35bits __attribute__((__sfr__));

