thelemon22/regis/demo_projects/dsPIC33E/h/p33EP256MU806.h
extern volatile unsigned int  PORTD __attribute__((__sfr__));
typedef struct tagPORTDBITS {
  unsigned RD0:1;
  unsigned RD1:1;
  unsigned RD2:1;
  unsigned RD3:1;
  unsigned RD4:1;
  unsigned RD5:1;
  unsigned RD6:1;
  unsigned RD7:1;
  unsigned RD8:1;
  unsigned RD9:1;
  unsigned RD10:1;
  unsigned RD11:1;
} PORTDBITS;
extern volatile PORTDBITS PORTDbits __attribute__((__sfr__));

extern volatile unsigned int  LATD __attribute__((__sfr__));
typedef struct tagLATDBITS {
  unsigned LATD0:1;
  unsigned LATD1:1;
  unsigned LATD2:1;
  unsigned LATD3:1;
  unsigned LATD4:1;
  unsigned LATD5:1;
  unsigned LATD6:1;
  unsigned LATD7:1;
  unsigned LATD8:1;
  unsigned LATD9:1;
  unsigned LATD10:1;
  unsigned LATD11:1;
} LATDBITS;
extern volatile LATDBITS LATDbits __attribute__((__sfr__));

extern volatile unsigned int  ODCD __attribute__((__sfr__));
typedef struct tagODCDBITS {
  unsigned ODCD0:1;
  unsigned ODCD1:1;
  unsigned ODCD2:1;
  unsigned ODCD3:1;
  unsigned ODCD4:1;
  unsigned ODCD5:1;
  unsigned :2;
  unsigned ODCD8:1;
  unsigned ODCD9:1;
  unsigned ODCD10:1;
  unsigned ODCD11:1;
} ODCDBITS;
extern volatile ODCDBITS ODCDbits __attribute__((__sfr__));

extern volatile unsigned int  CNEND __attribute__((__sfr__));
typedef struct tagCNENDBITS {
  unsigned CNIED0:1;
  unsigned CNIED1:1;
  unsigned CNIED2:1;
  unsigned CNIED3:1;
  unsigned CNIED4:1;
  unsigned CNIED5:1;
  unsigned CNIED6:1;
  unsigned CNIED7:1;
  unsigned CNIED8:1;
  unsigned CNIED9:1;
  unsigned CNIED10:1;
  unsigned CNIED11:1;
} CNENDBITS;
extern volatile CNENDBITS CNENDbits __attribute__((__sfr__));

extern volatile unsigned int  CNPUD __attribute__((__sfr__));
typedef struct tagCNPUDBITS {
  unsigned CNPUD0:1;
  unsigned CNPUD1:1;
  unsigned CNPUD2:1;
  unsigned CNPUD3:1;
  unsigned CNPUD4:1;
  unsigned CNPUD5:1;
  unsigned CNPUD6:1;
  unsigned CNPUD7:1;
  unsigned CNPUD8:1;
  unsigned CNPUD9:1;
  unsigned CNPUD10:1;
  unsigned CNPUD11:1;
} CNPUDBITS;
extern volatile CNPUDBITS CNPUDbits __attribute__((__sfr__));

extern volatile unsigned int  CNPDD __attribute__((__sfr__));
typedef struct tagCNPDDBITS {
  unsigned CNPDD0:1;
  unsigned CNPDD1:1;
  unsigned CNPDD2:1;
  unsigned CNPDD3:1;
  unsigned CNPDD4:1;
  unsigned CNPDD5:1;
  unsigned CNPDD6:1;
  unsigned CNPDD7:1;
  unsigned CNPDD8:1;
  unsigned CNPDD9:1;
  unsigned CNPDD10:1;
  unsigned CNPDD11:1;
} CNPDDBITS;
extern volatile CNPDDBITS CNPDDbits __attribute__((__sfr__));

extern volatile unsigned int  ANSELD __attribute__((__sfr__));
typedef struct tagANSELDBITS {
  unsigned :6;
  unsigned ANSD6:1;
  unsigned ANSD7:1;
} ANSELDBITS;
extern volatile ANSELDBITS ANSELDbits __attribute__((__sfr__));

extern volatile unsigned int  TRISE __attribute__((__sfr__));
typedef struct tagTRISEBITS {
  unsigned TRISE0:1;
  unsigned TRISE1:1;
  unsigned TRISE2:1;
  unsigned TRISE3:1;
  unsigned TRISE4:1;
  unsigned TRISE5:1;
  unsigned TRISE6:1;
  unsigned TRISE7:1;
} TRISEBITS;
extern volatile TRISEBITS TRISEbits __attribute__((__sfr__));

extern volatile unsigned int  PORTE __attribute__((__sfr__));
typedef struct tagPORTEBITS {
  unsigned RE0:1;
  unsigned RE1:1;
  unsigned RE2:1;
  unsigned RE3:1;
  unsigned RE4:1;
  unsigned RE5:1;
  unsigned RE6:1;
  unsigned RE7:1;
} PORTEBITS;
extern volatile PORTEBITS PORTEbits __attribute__((__sfr__));

extern volatile unsigned int  LATE __attribute__((__sfr__));
typedef struct tagLATEBITS {
  unsigned LATE0:1;
  unsigned LATE1:1;
  unsigned LATE2:1;
  unsigned LATE3:1;
  unsigned LATE4:1;
  unsigned LATE5:1;
  unsigned LATE6:1;
  unsigned LATE7:1;
} LATEBITS;
extern volatile LATEBITS LATEbits __attribute__((__sfr__));

extern volatile unsigned int  CNENE __attribute__((__sfr__));
typedef struct tagCNENEBITS {
  unsigned CNIEE0:1;
  unsigned CNIEE1:1;
  unsigned CNIEE2:1;
  unsigned CNIEE3:1;
  unsigned CNIEE4:1;
  unsigned CNIEE5:1;
  unsigned CNIEE6:1;
  unsigned CNIEE7:1;
} CNENEBITS;
extern volatile CNENEBITS CNENEbits __attribute__((__sfr__));

extern volatile unsigned int  CNPUE __attribute__((__sfr__));
typedef struct tagCNPUEBITS {
  unsigned CNPUE0:1;
  unsigned CNPUE1:1;
  unsigned CNPUE2:1;
  unsigned CNPUE3:1;
  unsigned CNPUE4:1;
  unsigned CNPUE5:1;
  unsigned CNPUE6:1;
  unsigned CNPUE7:1;
} CNPUEBITS;
extern volatile CNPUEBITS CNPUEbits __attribute__((__sfr__));

extern volatile unsigned int  CNPDE __attribute__((__sfr__));
typedef struct tagCNPDEBITS {
  unsigned CNPDE0:1;
  unsigned CNPDE1:1;
  unsigned CNPDE2:1;
  unsigned CNPDE3:1;
  unsigned CNPDE4:1;
  unsigned CNPDE5:1;
  unsigned CNPDE6:1;
  unsigned CNPDE7:1;
} CNPDEBITS;
extern volatile CNPDEBITS CNPDEbits __attribute__((__sfr__));

extern volatile unsigned int  ANSELE __attribute__((__sfr__));
typedef struct tagANSELEBITS {
  unsigned ANSE0:1;
  unsigned ANSE1:1;
  unsigned ANSE2:1;
  unsigned ANSE3:1;
  unsigned ANSE4:1;
  unsigned ANSE5:1;
  unsigned ANSE6:1;
  unsigned ANSE7:1;
} ANSELEBITS;
extern volatile ANSELEBITS ANSELEbits __attribute__((__sfr__));

extern volatile unsigned int  TRISF __attribute__((__sfr__));
typedef struct tagTRISFBITS {
  unsigned TRISF0:1;
  unsigned TRISF1:1;
  unsigned :1;
  unsigned TRISF3:1;
  unsigned TRISF4:1;
  unsigned TRISF5:1;
} TRISFBITS;
extern volatile TRISFBITS TRISFbits __attribute__((__sfr__));

extern volatile unsigned int  PORTF __attribute__((__sfr__));
typedef struct tagPORTFBITS {
  unsigned RF0:1;
  unsigned RF1:1;
  unsigned :1;
  unsigned RF3:1;
  unsigned RF4:1;
  unsigned RF5:1;
} PORTFBITS;
extern volatile PORTFBITS PORTFbits __attribute__((__sfr__));

extern volatile unsigned int  LATF __attribute__((__sfr__));
typedef struct tagLATFBITS {
  unsigned LATF0:1;
  unsigned LATF1:1;
  unsigned :1;
  unsigned LATF3:1;
  unsigned LATF4:1;
  unsigned LATF5:1;
} LATFBITS;
extern volatile LATFBITS LATFbits __attribute__((__sfr__));

extern volatile unsigned int  ODCF __attribute__((__sfr__));
typedef struct tagODCFBITS {
  unsigned ODCF0:1;
  unsigned ODCF1:1;
  unsigned :1;
  unsigned ODCF3:1;
  unsigned ODCF4:1;
  unsigned ODCF5:1;
} ODCFBITS;
extern volatile ODCFBITS ODCFbits __attribute__((__sfr__));

extern volatile unsigned int  CNENF __attribute__((__sfr__));
typedef struct tagCNENFBITS {
  unsigned CNIEF0:1;
  unsigned CNIEF1:1;
  unsigned :1;
  unsigned CNIEF3:1;
  unsigned CNIEF4:1;
  unsigned CNIEF5:1;
} CNENFBITS;
extern volatile CNENFBITS CNENFbits __attribute__((__sfr__));

